Repository: julioz07/dev-mode-wordpress
Catalog: languages/dev-mode-*.po
Languages: pt_pt

source: Alternates between two states: Active (allows changes) and Protected (blocks modifications to core, plugins, themes, and user creation).
pt_pt: Alterna entre dois estados: Ativo (permite alterações) e Protegido (bloqueia modificações ao core, plugins, temas e criação de utilizadores).

source: Plugin installations and updates are blocked while Dev.Mode is in Protected state.
pt_pt: Instalações e atualizações de plugins estão bloqueadas enquanto o Dev.Mode está em estado Protegido.

source: Downloads are blocked while Dev.Mode is in Protected state.
pt_pt: Downloads estão bloqueados enquanto o Dev.Mode está em estado Protegido.

source: Installations are blocked while Dev.Mode is in Protected state.
pt_pt: Instalações estão bloqueadas enquanto o Dev.Mode está em estado Protegido.

source: User creation is blocked while Dev.Mode is in Protected state.
pt_pt: Criação de utilizadores está bloqueada enquanto o Dev.Mode está em estado Protegido.

source: Access Denied
pt_pt: Acesso Negado

source: User creation via REST API is blocked while Dev.Mode is in Protected state.
pt_pt: Criação de utilizadores via REST API está bloqueada enquanto o Dev.Mode está em estado Protegido.

source: File editing is blocked while Dev.Mode is in Protected state.
pt_pt: Edição de ficheiros está bloqueada enquanto o Dev.Mode está em estado Protegido.

source: Dev.Mode Settings
pt_pt: Definições Dev.Mode

source: Dev.Mode Configuration
pt_pt: Configuração Dev.Mode

source: Current State
pt_pt: Estado Atual

source: Block User Creation
pt_pt: Bloquear Criação de Utilizadores

source: Block creation of new users when in Protected mode
pt_pt: Bloquear criação de novos utilizadores quando em modo Protegido

source: Disable File Modifications
pt_pt: Desativar Modificações de Ficheiros

source: Disable updates/installations/edits when in Protected mode
pt_pt: Desativar atualizações/instalações/edições quando em modo Protegido

source: Block PHP in Uploads
pt_pt: Bloquear PHP no Uploads

source: Apply rules to prevent PHP execution in /uploads directory
pt_pt: Aplicar regras para impedir execução de PHP no diretório /uploads

source: Auto-Revert Hours
pt_pt: Horas para Auto-Reversão

source: Automatically revert to Protected mode after X hours in Dev Mode (0 = disabled)
pt_pt: Reverter automaticamente para modo Protegido após X horas em Dev Mode (0 = desativado)

source: Configure Dev.Mode settings and security options.
pt_pt: Configure as definições do Dev.Mode e opções de segurança.

source: (will auto-revert in %s hours)
pt_pt: (vai reverter automaticamente em %s horas)

source: Dev Mode: Active
pt_pt: Dev Mode: Ativo

source: Dev Mode: Protected
pt_pt: Dev Mode: Protegido

source: Currently in Active state - changes are allowed.
pt_pt: Atualmente em estado Ativo - alterações são permitidas.

source: Currently in Protected state - changes are blocked.
pt_pt: Atualmente em estado Protegido - alterações estão bloqueadas.

source: You do not have sufficient permissions to access this page.
pt_pt: Não tem permissões suficientes para aceder a esta página.

source: Recent Activity Log
pt_pt: Log de Atividade Recente

source: No activity logged yet.
pt_pt: Ainda não há atividade registada.

source: Click to toggle Dev.Mode state
pt_pt: Clique para alternar o estado do Dev.Mode

source: Are you sure you want to activate Dev Mode? This will allow file modifications and other changes.
pt_pt: Tem a certeza que quer ativar o Dev Mode? Isto vai permitir modificações de ficheiros e outras alterações.

source: Are you sure you want to enable Protected mode? This will block modifications and secure the site.
pt_pt: Tem a certeza que quer ativar o modo Protegido? Isto vai bloquear modificações e proteger o site.

source: An error occurred while toggling Dev Mode state.
pt_pt: Ocorreu um erro ao alternar o estado do Dev Mode.

source: Switching...
pt_pt: A alternar...

source: Security check failed.
pt_pt: Verificação de segurança falhou.

source: You do not have permission to perform this action.
pt_pt: Não tem permissão para executar esta ação.

source: Dev.Mode state changed to %s.
pt_pt: Estado do Dev.Mode alterado para %s.

source: Active
pt_pt: Ativo

source: Protected
pt_pt: Protegido

source: Failed to change Dev.Mode state.
pt_pt: Falhou ao alterar o estado do Dev.Mode.

source: Dev.Mode has been automatically reverted to Protected state.
pt_pt: Dev.Mode foi automaticamente revertido para o estado Protegido.

source: Dev.Mode state has been updated successfully.
pt_pt: Estado do Dev.Mode foi atualizado com sucesso.

source: Settings saved successfully.
pt_pt: Definições guardadas com sucesso.
